Repository: haruyama/ssh_rfc_ja
Catalog: omegat/ssh/ssh-level2.tmx
Source language: en_us
Languages: ja

source: The Transport Model accepts messages from the SSH Subsystem, records the transport- related and SSH-security-related information, including the authenticated identity, in a cache referenced by tmStateReference, and passes the WholeMsg and the tmStateReference to the Dispatcher using the receiveMessage() ASI (Abstract Service Interface).
ja: トランスポートモデルは, SSH サブシステムからメッセージを受信し, tmStateReference によって参照されるキャッシュ中の認証された識別情報を含むトランスポートに関連する情報と SSHのセキュリティに関連する情報を記録する. そして, receiveMessage() ASI (Abstract Service Interface) を用いて. WholeMsg と tmStateReference を Dispatcher に渡す.

source: Local Flow Control
ja: ローカルなフロー制御

source: AES GCM will both encrypt the packet and form a 16-octet authentication tag to ensure data integrity.
ja: AES GCM は, パケットの暗号化とデータ完全性を保証する 16-オクテットの認証タグの形成の両方を行なう.

source: If the command string is empty, both "exec" and "shell" requests should be denied.
ja: このコマンド文字列が空なら, "exec" と "shell" の要求は禁止される必要がある.

source: However, if the resulting major_status is anything other than GSS_S_COMPLETE, or a non-zero-length token is returned, it is an error and the key exchange MUST fail.
ja: しかし, 結果の major_status が GSS_S_COMPLETE でなかったり 0でないトークンが返されたら, これはエラーで鍵交換は失敗しなければならない.

source: o The non-signature algorithms MUST either come exclusively from Family 1 or exclusively from Family 2.
ja: o 署名以外のアルゴリズムは, Family 1 から排他的にか Family 2 から排他的にか, どちらかで取得しなければならない.

source: o The information in the snmpSshtmSession group is generated locally when a client session is being opened or closed.
ja: o snmpSshtmSession グループの情報は, クライアントのセッションが開いているか閉じている場合にローカルに生成される.

source: 59 IEXTEN Enable extensions.
ja: 59 IEXTEN 拡張を有効にする.

source: The RFC 3411 architecture recognizes three levels of security:
ja: RFC 3411 のアーキテクチャは3つのセキュリティレベルを認識する:

source: Values of 'e' or 'f' that are not in the range [1, p-1] MUST NOT be sent or accepted by either side.
ja: [1, p-1] の範囲ではない'e' や 'f' の値は, どちらの側も送ったり受け取ったりしてはならない.

source: If the overwrite field is false and the specified key already exists, the server MUST return SSH_PUBLICKEY_KEY_ALREADY_PRESENT.
ja: overwrite フィールドが false で指定された鍵がすでに存在したら, サーバは SSH_PUBLICKEY_KEY_ALREADY_PRESENT を返さなければならない.

source: IANA had also assigned "netconf" as an SSH Subsystem Name, as defined in [RFC4250], as follows:
ja: IANA は [RFC4250] で定義された SSH Subsystem Name として "netconf" を以下のように割り当てた:

source: Running NETCONF as an SSH subsystem avoids the need for the script to recognize shell prompts or skip over extraneous information, such as a system message that is sent at shell start-up.
ja: SSHのサブシステムとして NETCONFを実行すると, シェルプロンプトをスクリプトが認識する必要や (シェルの起動時に送られるシステムメッセージのような)余計な情報をスクリプトがスキップする必要がなくなる.

source: Introduction ....................................................2 2.
ja: イントロダクション ..........................................2 2.

source: The size of a set of elliptic curve domain parameters on a prime curve is defined as the number of bits in the binary representation of the field order, commonly denoted by p.
ja: prime curve上の楕円曲線ドメインパラメータの集合のサイズは, フィールドオーダーの2進表現のビット数で定義される. 通常 p で示される.

source: However, it is suggested that if a 'configure' script is used, any non-standard 'signal name' values it finds be encoded as "SIG@xyz.config.guess", where "SIG" is the 'signal name' without the "SIG" prefix, and "xyz" is the host type, as determined by "config.guess".
ja: しかし, 'configure' スクリプトが使われるなら, どんな非標準の 'signal name' の値も "SIG@xyz.config.guess" という形式でエンコードされることが推奨される. ここで, "SIG" は SIG接頭辞を除いた 'signal name' で "xyz" は "config.guess" で決定されるホストタイプだ.

source: Message numbers used by services should be in the area reserved for them (see [SSH-ARCH] and [SSH-NUMBERS]).
ja: サービスで用いられるメッセージ番号は, 予約されている領域のものを利用しなければならない([SSH-ARCH] と [SSH-NUMBERS] を参照).

source: From an internationalization standpoint, it is desired that if a user enters their password, the authentication process will work regardless of what OS and client software the user is using.
ja: 国際化の立場から, パスワード認証が行なわれるときに, ユーザの使うOSやクライアントのソフトウェアに依らずに認証が行なわれることが望ましい.

source: In that case, the data is first hashed with HASH to compute H, and H is then hashed with SHA-1 as part of the signing operation.
ja: この場合, データはまず H を計算するために HASH でハッシュされる. そして H は署名の計算の一部分として SHA-1 でハッシュされる.

source: In addition, this protocol is vulnerable to denial of service attacks because an attacker can force the server to go through the CPU and memory intensive tasks of connection setup and key exchange without authenticating.
ja: 加えて, このプロトコルは, サービス妨害攻撃に対して脆弱だ. なぜなら,接続の設定や認証なしの鍵交換といったCPUやメモリをたくさん利用するタスクの実行を, 攻撃者がサーバに強制できるからだ.

source: Because the GSS-API mechanism uses the targ_name to authenticate the server's identity, it is important that it be determined in a secure fashion.
ja: GSS-APIメカニズムは サーバの識別情報の認証に targ_name を用いるので, 安全な方法で決定することは重要だ.

source: This key-exchange method is designed to be resistant to collision attacks on the exchange hash, by ensuring that neither side is able to freely choose its input to the hash after seeing all of the other side's input.
ja: この鍵交換法は, 交換ハッシュの衝突攻撃に耐性があるように設計されている. クライアントもサーバももう一方の側の入力をすべて見たあとで, ハッシュへの入力を自由に選ぶことができないことが保証されているからだ.

source: Such a mechanism does not exist for SSH and thus SNMP applications should keep SSH sessions for longer time periods.
ja: このようなメカニズムは SSH には存在しないので, SNMP アプリケーションは SSH のセッションをより長い期間保持するべきだ.

source: Covert Channels ....................................20 9.3.7.
ja: コバートチャンネル(隠れチャンネル, プロトコルの想定外の手段で情報を伝えること) ....................................20 9.3.7.

source: The ciphers in each direction MUST run independently of each other.
ja: それぞれの通信の方向の暗号は, お互いに独立に動作しなければならない.

source: This protocol requires the client to assume that the server will correctly implement and observe attributes applied to keys.
ja: このプロトコルは, サーバが正しく実装され鍵に適用された属性を観測できるという前提をクライアントに要求している.

source: The server should use whatever method is appropriate for its platform to identify the host -- e.g., for IP- based networks, checking the IP address or performing a reverse DNS lookup.
ja: 例えば, IPベースのネットワークでIPアドレスをチェックしたり DNS逆引きを実行するなど, その環境に適したホストを特定する方法をサーバは利用する必要がある.

source: Implementers, administrators, and users who wish to further explore the security mechanisms of X11 are invited to read [SCHEIFLER] and analyze previously reported
ja: X11のセキュリティメカニズムをさらに詳しく知りたい実装者と管理者, ユーザは [SCHEIFLER]を読みSSHの転送とX11の相互作用で以前報告された問題 (CERT vulnerabilities VU#363181 と VU#118892 [CERT])について分析することを勧める.

source: This document obsoletes RFC 4742.
ja: この文書は RFC 4742 を廃止する.

source: The difficulty of breaking the ECDLP depends on the size and quality of the elliptic curve parameters.
ja: ECDLPを破る難易度は, 楕円曲線パラメータのサイズと品質に依存する.

source: Environment variables may be passed to the shell/command to be started later.
ja: 後で開始されるシェルやコマンドに, 環境変数を転送することができる.

source: It then sends the following:
ja: そして 以下を送る.

source: All other intermediate certificates in the chain leading to a root authority MUST be included.
ja: ルート認証局につながる他の中間証明書はすべて含まれなければならない.

source: As described in Section 9.3.3, a successful attack of this nature is very improbable.
ja: 9.3.3節で述べたように, この手の攻撃が成功するのはほとんどありえない.

source: Once computed, the session identifier is not changed, even if keys are later re-exchanged.
ja: 一度計算されたら, セッション識別子は変更されない. たとえ, あとで鍵を再交換してもだ.

source: The amount of entropy available to a given client or server may sometimes be less than what is required.
ja: クライアントやサーバで利用できるエントロピーの量が, 必要よりも少ないことがある.

source: Initial Assignments
ja: 初期の割り当て

source: The Elliptic Curve Diffie-Hellman (ECDH) key exchange is defined by a family of method names.
ja: 楕円曲線 Diffie-Hellman (ECDH) 鍵交換は, 方法の名前のファミリで定義される.

source: The client MAY send the signature directly without first verifying whether the key is acceptable.
ja: クライアントは, 鍵が受け入れられるかの最初の確認なしに直接署名を送ってもよい.

source: As stated in Section 3.1, in SecSh-B, the server host key algorithm MUST be either x509v3-ecdsa-sha2-nistp256 or x509v3-ecdsa-sha2-nistp384.
ja: 3.1 節で述べたように, SecSh-B では, サーバのホスト鍵アルゴリズムは, x509v3-ecdsa-sha2-nistp256 か x509v3-ecdsa-sha2-nistp384 でなければならない.

source: It is similar to the UNIX "rhosts" and "hosts.equiv" styles of authentication, except that the identity of the client host is checked more rigorously.
ja: これは, UNIXの "rhosts" と "hosts.equiv" スタイルの認証に似ている. ただし, クライアントホストの識別がより厳格にチェックされることが異なる.

source: Currently defined authentication methods for SSH are tightly coupled with the underlying authentication mechanism.
ja: 現在SSHのために定義されている認証法は, 基盤となっている認証メカニズムと密に結合している.

source: The increase is negligible for large packets, but very significant for one-byte packets (telnet-type sessions).
ja: 大きなパケットについては, 増大は無視できる. しかし, (telnetタイプのセッションでの) 1バイトのパケットについては非常に大きい.

source: As this is a list of names, all of the elements contained are names and MUST be in US-ASCII.
ja: name のリストであるので, すべての含まれる要素は name だ. また US-ASCIIでなければならない.

source: As in Section 9.3.3, this reasoning does assume that the MAC is secure and that it is infeasible to construct inputs to a MAC algorithm to give a known output.
ja: 9.3.3節で挙げたように, この理由は MACが安全であることを仮定している. すなわち, 既知の出力に対するMACのアルゴリズムの入力を構築するのが困難であることを仮定している.

source: Security Considerations
ja: セキュリティの考察

source: Weak Transport
ja: 弱いトランスポート

source: Console Server vendors interpret the TELNET BREAK signal as a physical BREAK signal, which can then allow access to the full range of administrative functions available on an asynchronous serial console port.
ja: Console Server のベンダーは, TELNET BREAK 信号を 物理的な BREAK 信号として解釈する. これにより, 非同期シリアルコンソールポートで利用可能な管理機能のすべての範囲へのアクセスを可能にする.

source: User authentication protocol:
ja: ユーザ認証プロトコル:

source: 18 VDISCARD Toggles the flushing of terminal output.
ja: 18 VDISCARD 端末の出力をflushするかを切り替える.

source: 58 TOSTOP Stop background jobs from output.
ja: 58 TOSTOP バックグラウンドのジョブから出力があったらジョブを止める.

source: - with authentication and with privacy (authPriv)
ja: - 認証あり, プライバシーあり (authPriv)

source: As indicated above, end-point security is assumed during proxy forwarding operations.
ja: 前述のように , プロキシ転送の操作ではエンドポイントのセキュリティが前提とされる.

source: Old Client, New Server .....................................6 5.2.
ja: 古いクライアントで新しいサーバ..........................6 5.2.

source: In that dialog window, the instruction field would be a text message, and the prompts would be labels for text entry fields.
ja: このダイアログウィンドウで, instruction フィールドはテキストのメッセージで, prompt はテキストエントリフィールドのラベルとなるだろう.

source: Researchers have shown that the original CBC-based encryption methods in [RFC4253] are vulnerable to chosen-plaintext privacy attacks [DAI,BKN1,BKN2].
ja: [RFC4253] の元々のCBCモードベースの暗号法は, 選択平文攻撃に対して脆弱だと研究者は示した.[DAI, BKN1, BKN2].

source: All implementations MUST understand (and ignore) this message at any time (after receiving the identification string).
ja: すべての実装は, (識別文字列を受け取った後の)どの時点でもこのメッセージを理解(そして無視)しなければならない.

source: This method provides explicit server identification as defined in Section 7 of [RFC4253].
ja: [RFC4253] の7節で定義されているように, この方法は明示的なサーバの認証を提供する.

source: 34 INLCR Map NL into CR on input.
ja: 34 INLCR 入力でNLをCRに置き換える.

source: - with authentication but without privacy (authNoPriv)
ja: - 認証あり, プライバシーなし (authNoPriv)

source: o The Connection Protocol [RFC4254] multiplexes the encrypted tunnel into several logical channels.
ja: o コネクションプロトコル [RFC4254] は暗号化されたトンネルをいくつかの論理的なチャンネルに多重化する.

source: Algorithm Negotiation: SSH_MSG_KEXINIT .....................7 4.
ja: アルゴリズムの交渉: SSH_MSG_KEXINIT .....................7 4.

source: the entire ciphertext C=C1||C2||...||Cn corresponding to the packet P. Note that the counter X is not included in the ciphertext.
ja: 注意: カウンタ X は暗号文に含まれない.

source: The message text MUST be encoded in the UTF-8 encoding described in [UTF8].
ja: message テキストは [UTF8] に記述されている UTF-8 エンコーディングでエンコードされてなければならない.

source: random padding Arbitrary-length padding, such that the total length of (packet_length || padding_length || payload || random padding) is a multiple of the cipher block size or 8, whichever is
ja: random padding 任意の長さのパディング, (packet_length || padding_length || payload || random padding) の全体の長さが, 暗号のブロックサイズか8のどちらか大きいほうの倍数になるようにする.

source: Applications typically use the terminal type to determine what character set they use, or the character set is determined using some external means.
ja: アプリケーションは, 利用する文字セットを決定するために端末タイプを典型的に利用する. もしくは, 文字セットは他の外部の方法によって決定される

source: If any call to GSS_Init_sec_context() or GSS_Accept_sec_context() returns a major_status other than GSS_S_COMPLETE or GSS_S_CONTINUE_NEEDED, or any other GSS-API call returns a major_status other than GSS_S_COMPLETE, the key exchange fails.
ja: GSS_Init_sec_context() や GSS_Accept_sec_context() の呼び出しで GSS_S_COMPLETE か GSS_S_CONTINUE_NEEDED 以外の major_status コードが返ったり, 他の GSS-APIの呼び出しで GSS_S_COMPLETE 以外の major_status コードが返ったら, 鍵交換は失敗する.

source: Transport Models SHOULD generate a predictable tmSecurityName so operators will know what to use when configuring MIB modules that use securityNames derived from tmSecurityNames.
ja: トランスポートモデルは, tmSecurityName から導出される securityName を用いる MIBモジュールを設定する際にオペレータが何を用いるか知ることができるよう, 予測可能な tmSecurityName を生成する必要がある.

source: This flag SHOULD be set to "false".
ja: このフラグは "false" に設定する必要がある．

source: "shell" specifies that session channel "shell" requests should be denied when this key is in use.
ja: "shell" は, この鍵を用いるとセッションチャンネルの "shell" 要求が拒否されることを指定する.

source: The associated Disconnection Message 'description' is a human-readable message that describes the disconnect reason.
ja: 関連する切断メッセージの 'description' は, 切断の理由を示す人間が解読できるメッセージだ.

source: Every compliant SSH ECC implementation MUST implement ECDH key exchange.
ja: すべての準拠する SSH ECC実装は, ECDH 鍵交換を実装しなければならない.

source: The SSH Transport Model SHOULD be able to take advantage of future-defined ssh-userauth methods, such as those that might make use of X.509 certificate credentials.
ja: SSH トランスポートモデルは, X.509 証明書を利用するもののような, 将来定義される ssh-userauth 法を活用できるようにする必要がある.

source: It is expected that these will include a general file transfer mechanism, and possibly other features.
ja: サブシステムには一般的なファイル転送メカニズムやあるいは他の特徴が含まれることが期待される.

source: We believe that the protocol will evolve over time, and some organizations will want to use their own encryption, authentication, and/or key exchange methods.
ja: このプロトコルは今後も発展していくし, また, いくつかの組織が彼らが作成した暗号化や認証や鍵交換法を利用したいと考えるだろう.

source: Public Key Format .
ja: 公開鍵の形式 .

source: This memo describes methods for using the GSS-API for authentication and key exchange in SSH.
ja: このメモは, SSHで認証と鍵交換のためにGSS-APIを使う方法を記述する.

source: The policy MUST specify which is the preferred algorithm (e.g., the first algorithm listed in each category).
ja: ポリシーは, 優先されるアルゴリズムがなにかを指定しなければならない(たとえば, それぞれのカテゴリで最初に挙げられたアルゴリズム) .

source: The implementer MUST ensure that the credentials provided validate the professed user and also MUST ensure that the local policy of the server permits the user the access requested.
ja: 実装者は, 提供された認証情報でユーザを認証することを保証しなければならない. また, サーバのローカルなポリシーが, 要求されたアクセスをユーザに許すことを保証しなければならない.

source: Public Key Subsystem Status Codes .
ja: 公開鍵サブシステムの状態コード .

source: Public key algorithms are defined in the transport layer specification [SSH-TRANS].
ja: 公開鍵アルゴリズムは, トランスポート層の仕様 [SSH-TRANS] で定義されている.

source: In particular, attacks are not impossible, just extremely improbable (unless the building blocks, like AES, are insecure).
ja: 特に, (AESのようにブロックの作成が安全でない場合でなければ) 攻撃はほとんど不可能で, まったく起こりえない.

source: Algorithm Number Specification
ja: アルゴリズム番号の仕様

source: o Key Exchange Method Names
ja: o 鍵交換法の名前

source: string user_name // in ISO-10646 UTF-8 encoding
ja: string user_name // ISO-10646 UTF-8 エンコーディング

source: This document describes a protocol that can be used to configure public keys in an implementation-independent fashion, allowing client software to take on the burden of this configuration.
ja: この文書では, 実装に依存しない形で公開鍵を設定するのに利用できるプロトコルを定義する. この設定に対する負担はクライアントソフトウェアが引き受ける.

source: encryption_algorithms A name-list of acceptable symmetric encryption algorithms (also known as ciphers) in order of preference.
ja: encryption_algorithms 受け入れ可能な対称暗号化アルゴリズム( cipher としても知られる) の優先度順の名前リスト.

source: Note that both the client and server MAY send global requests at any time, and the receiver MUST respond appropriately.
ja: クライアントもサーバもいつでも全体的な要求を送ってよく受け取り手は適切に返答しなければならないことに注意.

source: The SSH Transport Model assumes that TCP and IP continue to operate correctly between the communicating nodes.
ja: SSH トランスポートモデルは, 通信ノード間で TCP と IP が正しく動作し続けることを仮定している.

source: Let L be the block length of <cipher> in bits.
ja: L を <cipher>のビットでのブロック長とする

source: If 'single connection' is TRUE, only a single connection should be forwarded.
ja: 'single connection' が TRUE なら, 単一の接続のみが転送されるべきだ.

source: Note that numbers 30-49 are used for kex packets.
ja: 番号 30-49 が, 鍵交換のパケットに使われることに注意.

source: The SNMP-NOTIFICATION-MIB contains a list of targets to which notifications should be sent.
ja: SNMP-NOTIFICATION-MIB は, 通知が送られるべきターゲットのリストを含む.

source: This memo describes a key-exchange method for the Secure Shell (SSH) protocol based on Rivest-Shamir-Adleman (RSA) public-key encryption.
ja: このメモは, Rivest-Shamir-Adleman (RSA) 公開鍵暗号に基づくセキュア シェル (SSH) プロトコルのための鍵交換法を記述している.

source: ECDSA-256 or ECDSA-384 (min_LOS 128): server_host_key_algorithms name_list := { x509v3-ecdsa-sha2-nistp256, x509v3-ecdsa-sha2-nistp384 }
ja: ECDSA-256 もしくは ECDSA-384 (min_LOS 128): server_host_key_algorithms name_list := { x509v3-ecdsa-sha2-nistp256, x509v3-ecdsa-sha2-nistp384 }

source: When the command running at the other end terminates, the following message can be sent to return the exit status of the command.
ja: 相手側で動作していたコマンドが終了すると, コマンドの終了ステータスを返却するために次のメッセージが送られる.

source: [RFC3447] recommends that RSA keys used with RSAES-OAEP not be used with other schemes, or with RSAES-OAEP using a different hash function.
ja: [RFC3447] は, RSAES-OAEP で用いる RSA 鍵が 他の方式で用いられていない, また, 異なるハッシュ関数を用いた RSAES-OAEP で用いられていないことを推奨している.

source: SSH_MSG_USERAUTH_SUCCESS MUST be sent only once.
ja: SSH_MSG_USERAUTH_SUCCESS は1回のみ送られなければならない.

source: The terminating null character SHOULD NOT normally be stored in the string.
ja: 終端のnull 文字は, 通常はstringには格納しないほうがよい.

source: This document specifies in Section 6.2.1 which SHA2 variant should be used with which elliptic curve size based on this guidance.
ja: この文書では, このガイダンスに基づく楕円曲線のサイズと共に利用する必要のある SHA2のバリエーションを 6.2.1節で指定している.

source: Initial Assignments .
ja: 初期の割り当て .

source: Secure Shell allows either the server or client to request that the Secure Shell connection be rekeyed.
ja: セキュアシェルは, サーバとクライアントのどちらもがセキュアシェル接続の鍵の再生成を要求できる.

source: The 'service name' is used to describe a protocol layer.
ja: 'service name' は, プロトコルの層を記述するのに使われる.

source: When the connection has been established, both sides MUST send an identification string.
ja: 接続が確立したら, 両方の側が識別文字列を送らなければならない.

source: Galois/Counter Mode
ja: Galois(ガロア)/カウンタモード

source: It then sends the following message to the other side, and includes the local channel number and initial window size in the message.
ja: 次のメッセージを相手側に送る. メッセージにはローカルなチャンネル番号と初期 window サイズ が含まれる.

source: The Diffie-Hellman key exchange provides a shared secret that cannot be determined by either party alone.
ja: Diffie-Hellman 鍵交換は, 一方の側だけでは決定できない共有の秘密を提供する.

source: This modularity of specification is not meant to be interpreted as imposing any specific requirements on implementation.
ja: 仕様のこのモジュール性は, 実装上特定の要件を課すように解釈されることを意図していない.

source: A boolean value is stored as a single byte.
ja: boolean の値は, 単一のbyteに格納される.

source: Some of the readable objects in this MIB module (i.e., objects with a MAX-ACCESS other than not-accessible) may be considered sensitive or vulnerable in some network environments.
ja: この MIB モジュールの読み込み可能なオブジェクト (つまり, アクセス不能以外の MAX-ACCESS を持つオブジェクト) のいくつかは, ネットワーク環境に敏感か脆弱だと考えられる.

source: The following is a summary of messages and their associated message number.
ja: メッセージのまとめと関連するメッセージ番号を以下に示す.

source: Note that the integers r and s are integers modulo the order of the cryptographic subgroup, which may be larger than the size of the finite field.
ja: 整数 r と s は, 暗号学的なサブグループのオーダーを法とする整数で, 有限体のサイズよりも大きいかもしれないことに注意.

source: The "hmac-*" algorithms are described in [RFC2104].
ja: "hmac-*" アルゴリズムは, [RFC2104] に記述されている..

source: This algorithm is defined in [DES].
ja: このアルゴリズムは, [DES]で定義されている.

source: Implementers SHOULD ensure that any ephemeral private keys or random values -- including the value k used in ECDSA signature generation and the ephemeral private key values in ECDH and ECMQV -- are generated from a random number generator or a properly seeded pseudorandom number generator, are protected from leakage, are not reused outside of the context of the protocol in this document, and are erased from memory when no longer needed.
ja: すべての一時秘密鍵や乱数値 -- ECDSA署名生成での値 k や ECDHやECMQVの一時秘密鍵の値を含む -- が乱数生成器か適切にシードされ(漏洩から保護され)た疑似乱数生成器から生成され, この文書でのプロトコルの文脈の外側で再利用されず, 必要なくなった際にメモリから削除されるように 実装者は保証する必要がある.

source: Without the confidentiality provided therein, any authentication data passed with this method is subject to interception.
ja: 秘匿性が提供されないと, この方法で転送されるすべての認証データは傍受されます.

source: Capabilities Exchange
ja: 機能の交換

source: Message Authentication ..............................9 3.1.3.
ja: メッセージ認証 ..............................9 3.1.3.

source: It is up to the server how it interprets the responses and validates them.
ja: response をどう解釈し検証するかは サーバ次第だ.

source: The 'originator IP address' is the numeric IP address of the machine from where the connection request originates, and the 'originator port' is the port on the host from where the connection originated.
ja: 'originator IP address' は, 接続要求が開始されたマシンの数値のIPアドレスだ. 'originator port' は, 接続が開始されたホストのポートだ.

source: The use of elliptic curve cryptography should not place a significant computational burden on an implementing server.
ja: 楕円曲線暗号の利用は, 実装したサーバに重大な計算の負担を発生されるものではないはずだ.

source: When the client's call to GSS_Init_sec_context() returns GSS_S_COMPLETE with the integ_avail flag not set, the client MUST conclude the user authentication exchange by sending the following message:
ja: GSS_Init_sec_context() のクライアントの呼び出し結果が GSS_S_COMPLETE で integ_avail フラグが設定されていないなら、 クライアントは 次のメッセージを送ってユーザ認証の交換を成立させなければならない.

source: A client MUST NOT send a subsequent request if it has not received a response from the server for a previous request.
ja: クライアントは, 前の要求に対するサーバの応答を受け取っていなければ, 次の要求を送ってはならない.

source: The client MAY ignore these messages.
ja: クライアントはこれらのメッセージを無視してもよい.

source: The stream is terminated by opcode TTY_OP_END (0x00).
ja: ストリームは, opcode TTY_OP_END (0x00) で終わる.

source: In most places, ISO-10646 UTF-8 encoding is used [RFC3629].
ja: ほとんどの場合, ISO-10646 UTF-8 エンコーディングが使われる [RFC3629].

source: This is implemented using the following messages, in addition to those described above:
ja: 上記で定義したものに加えて， 以下のメッセージをこの記述では用いる．

source: These are discussed in detail below.
ja: これらは以下で詳細に議論する.

source: If want reply is TRUE, the server MUST respond with SSH_MSG_CHANNEL_SUCCESS if the Public Key Subsystem was successfully started, or SSH_MSG_CHANNEL_FAILURE if the server failed to start or does not support the Public Key Subsystem.
ja: want reply が TRUE の場合, 公開鍵サブシステムの開始に成功したら SSH_MSG_CHANNEL_SUCCESS をサーバは返さなければならない. 公開鍵サブシステムの開始に失敗したりサポートしていなければ SSH_MSG_CHANNEL_FAILURE サーバは返さなければならない.

source: The 'initial window size' specifies how many bytes of channel data can be sent to the sender of this message without adjusting the window.
ja: 'initial window size'は, チャンネルのデータをこのメッセージの送り手にwindow の調整なしで送れる byte 数を指定する.

source: o The Transport Layer Protocol [RFC4253] provides server authentication and message confidentiality and integrity.
ja: o トランスポート層プロトコル[RFC4253] は, サーバの認証, メッセージの機密性, 完全性を提供する.
